
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    [{"authors":null,"categories":null,"content":"Angelika Fedorova is a bachelor’s student in Computer and Information Sciences at the Peoples’ Friendship University of Russia. I am currently studying data analytics and machine learning. I also like to study foreign languages.\n","date":1607817600,"expirydate":-62135596800,"kind":"term","lang":"en","lastmod":1714003200,"objectID":"2525497d367e79493fd32b198b28f040","permalink":"","publishdate":"0001-01-01T00:00:00Z","relpermalink":"","section":"authors","summary":"Angelika Fedorova is a bachelor’s student in Computer and Information Sciences at the Peoples’ Friendship University of Russia. I am currently studying data analytics and machine learning. I also like to study foreign languages.","tags":null,"title":"Angelika","type":"authors"},{"authors":[],"categories":null,"content":" Click on the Slides button above to view the built-in slides feature. Slides can be added in a few ways:\nCreate slides using Hugo Blox Builder’s Slides feature and link using slides parameter in the front matter of the talk file Upload an existing slide deck to static/ and link using url_slides parameter in the front matter of the talk file Embed your slides (e.g. Google Slides) or presentation video on this page using shortcodes. Further event details, including page elements such as image galleries, can be added to the body of this page.\n","date":1906549200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1906549200,"objectID":"a8edef490afe42206247b6ac05657af0","permalink":"http://localhost:1313/talk/example-talk/","publishdate":"2017-01-01T00:00:00Z","relpermalink":"/talk/example-talk/","section":"event","summary":"An example talk using Hugo Blox Builder's Markdown slides feature.","tags":[],"title":"Example Talk","type":"event"},{"authors":null,"categories":null,"content":"from IPython.core.display import Image Image(\u0026#39;https://www.python.org/static/community_logos/python-logo-master-v3-TM-flattened.png\u0026#39;) print(\u0026#34;Welcome to Academic!\u0026#34;) Welcome to Academic! Organize your notebooks Place the notebooks that you would like to publish in a notebooks folder at the root of your website.\nImport the notebooks into your site pipx install academic academic import \u0026#39;notebooks/**.ipynb\u0026#39; content/post/ --verbose The notebooks will be published to the folder you specify above. In this case, they will be published to your content/post/ folder.\n","date":1699056000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1699056000,"objectID":"94fa5e486d3bf3e0941e2ff6e7126c06","permalink":"http://localhost:1313/post/blog-with-jupyter/","publishdate":"2023-11-04T00:00:00Z","relpermalink":"/post/blog-with-jupyter/","section":"post","summary":"Easily blog from Jupyter notebooks!","tags":null,"title":"Blog with Jupyter Notebooks!","type":"post"},{"authors":["Angelika"],"categories":["Demo"],"content":"About the Git version control system What is a “version control system” and why is it important? A version control system is a system that records changes to a file or set of files over time and allows you to revert to a specific version later. For file version control, this book will use software source code as an example, although in reality you can use version control for almost any type of file.\nLocal version control systems Many people use copying files into a separate directory (maybe even a timestamped directory if they’re smart enough) as a method of version control. This approach is very common due to its simplicity, but it is incredibly error prone. It can be easy to forget which directory you are in and accidentally change the wrong file or copy the wrong files that you intended.\nTo solve this problem, programmers long ago developed local VCSs with a simple database that keeps a record of all changes to files, thereby maintaining revision control.\nOne popular VCS was the RCS system, which is still distributed with many computers today. RCS stores sets of patches (differences between files) on disk in a special format, using which it can recreate the state of each file at a given point in time.\nCentralized version control systems The next major problem that people face is the need to interact with other developers. In order to deal with it, centralized version control systems (Centralized Version Control System, hereinafter CVCS) were developed. Systems such as CVS, Subversion, and Perforce use a single server that contains all versions of files, and a number of clients that retrieve files from this centralized repository. CVCS has been the standard for many years.\nThis approach has many advantages, especially over local VCS. For example, all project developers know to a certain extent what each of them does. Administrators have full control over who can do what, and it is much easier to administer CVCS than to operate local databases on each client.\nDespite this, this approach also has serious disadvantages. The most obvious disadvantage is the single point of failure represented by a centralized server. If this server goes down for an hour, then during that time no one will be able to use version control to save the changes they are working on, and no one will be able to share those changes with other developers.\nDistributed version control systems This is where distributed version control systems (DVCS) come into play. In a DVCS (such as Git, Mercurial, Bazaar or Darcs), clients don’t just download a snapshot of all files (the state of the files at a certain point in time) — they copy the entire repository. In this case, if one of the servers through which the developers were communicating dies, any client repository can be copied to another server to continue working. Each copy of the repository is a complete backup of all data.\nMoreover, many DVCS can interact with multiple remote repositories at the same time, so you can work with different groups of people using different approaches at the same time within the same project. This allows you to use several development approaches at once, for example, hierarchical models, which is completely impossible in centralized systems.\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1710201600,"objectID":"0c6f6cbe96ac9b1239a629e09477d6d1","permalink":"http://localhost:1313/post/post2/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post2/","section":"post","summary":"This chapter is about getting started with Git. First, we'll learn the basics of version control systems, then we'll move on to how to run Git on your OS and finally set it up for work. At the end of the chapter, you will already know what Git is and why you should use it, and you will also have a system that is finally configured to work.","tags":["Academic"],"title":"About the Git version control system","type":"post"},{"authors":["Angelika"],"categories":["Demo"],"content":"Studies I somehow rested more and tried to force myself to program. But I completed a course in machine learning\nHobbies I read a book in English and decided to also study Japanese.\nWork I registered for the meetups that I’m going to attend next week.\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1711065600,"objectID":"d084acea3d1051f530a6486b095c70b4","permalink":"http://localhost:1313/post/post3/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post3/","section":"post","summary":"what happened during the period from 03/17/2024 to 03/23/2024","tags":["Academic"],"title":"Another normal week","type":"post"},{"authors":["Angelika"],"categories":["Demo"],"content":"How to create a good presentation Formulate a topic It is difficult to listen to an interlocutor who jumps from one thing to another, so the presentation should have only one topic. Otherwise it will be a long story about nothing. The topic should be narrow enough to provide a solution to the problem at the end. Narrow the topic until the presentation can be summarized in ten short paragraphs. It is easy to identify a good topic - it itself suggests the structure of the speech.\nDefine your goal A good presentation changes the existing picture of the world. For example, people are starting to be more environmentally friendly or running for a new smartphone. The goal does not have to be ambitious, the main thing is specific. A good presentation goal begins with a question: What do I want to change in the audience’s behavior?\nThink through the scenario The purpose of the presentation is what you want to change in the listener’s mind, and the script is how you will achieve these changes. Imagine that you are making up a story. The listener needs to be intrigued, come up with an interesting character, and lead him through difficulties to a successful ending. This is the basic structure of any text and presentation. Fairy tales, film scripts, and product advertisements are based on this structure:\nBring you up to date. Intrigue Thesis. This is the main motive of the presentation, what you want to teach people. Antithesis. Show the other side of the coin. This builds trust and warns against problems that a person may encounter in practice. Conclusion. A bad presentation ends with “that’s all.” Conclude with a short summary or conclusion. After your speech, the person should understand what he can do right now. Show examples Less theory - more life. Show how your product works and how people use it. Real stories of people, screenshots of programs and live photographs of the product look more convincing than dry text and photos from stock photos.\nAlternate slides Presentation is like text. If the text consists of sentences of the same length and the same type, reading will be boring. No rhythm. Therefore, alternate text slides and slides with images, add graphics. Sometimes you can joke.\nTell me what to do next A bad speech ends with: “That’s it, now the questions.” This way you leave the listener alone with his thoughts.\nA good presentation gives clear instructions on what to do next. This is not necessarily a call to action. At the end, you can go over the conclusions again, emphasize the main thesis, or tell where to get additional information.\nFewer flowers The presentation should have 1-2 primary colors. For example, for background, text and icons. Follow the chosen sequence and do not change colors unnecessarily. Choosing colors on your own is quite difficult, especially if you are not a designer. If you’re making a corporate presentation, use brand colors. If there are no corporate colors, use Tilda Colors. Copy the color you like by clicking on its code or on the color palette.\nMore contrast White on blue can look nice on your Retina computer. But if you have to show the presentation through a projector, the text will not be read. Therefore, use contrasting colors. The biggest contrast: black and white. The rest can be checked using the contrast testing service.\nFewer fonts One font is enough to create a presentation. Take a modern sans serif font: Tilda Sans, Open Sans, Roboto, PT Sans (these fonts are free to use). These are simple fonts that are easy to read. It’s easy to check: step away from the screen and try to read the headline. If it’s easy to read, you guessed it. Emphases can be made by changing the font weight.\nRule of thirds This rule for creating presentations helps to arrange objects on a slide so that the eye immediately highlights the most important things. Divide the slide into thirds lengthwise and crosswise. Place significant objects at intersections. Significant objects are headings and illustrations.\nThe texts are shorter One slide - one thought. This slide is easy to read and remember. If you are speaking in public, it will maintain the audience’s attention. Exactly how much text will be on the slide depends on the size of the audience. If a person is reading a presentation on the screen, a paragraph of text will not scare him. If you are speaking to an audience of a hundred people, it will be difficult to read more than ten words on a slide.\nCalculate how many slides should be in the presentation A simple rule that can be taken as a basis when creating presentations is one slide per minute. If your speech is designed for 30 minutes, then the optimal number of slides is also 30!\nAdd images Photos and icons help to highlight the content, but should not replace it. If you find a beautiful “on-topic” photo that doesn’t help convey the idea, don’t use it.\n14.Make friends slides In a presentation, all elements should be friendly, that is, be of the same type. Then it is perceived easily …","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1713225600,"objectID":"53a087908899411dab3858677c03ade5","permalink":"http://localhost:1313/post/post6/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post6/","section":"post","summary":"A small guide to creating a good presentation","tags":["Academic","Обучение"],"title":"Creating a presentation","type":"post"},{"authors":["Angelika"],"categories":["Demo"],"content":"What are the most advanced skills? Fundamentals of statistics and mathematics. To be successful in machine learning, you need to have a good understanding of basic concepts in statistics and mathematics, such as probability, linear algebra, optimization, and probability theory.\nProgramming in Python. Python is one of the most popular programming languages ​​in machine learning. In the courses, you will learn the basics of the Python language and learn how to use it to solve machine learning problems.\nAlgorithms and data structures. Knowledge of basic algorithms and data structures is an important component of successful work in machine learning. In the courses, you will learn various machine learning algorithms such as linear regression, decision trees, random forests, and neural networks.\nWorking with data. In machine learning, data plays a key role. In the courses you will learn to collect, process and analyze data using various tools and libraries such as Pandas and NumPy.\nDeep learning. Deep learning is one of the hottest areas of machine learning. In the courses you will learn how to work with neural networks and use them to solve complex problems such as pattern recognition and natural language processing.\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1607817600,"objectID":"0eab8df412fded1a34ee2f1563e8efb7","permalink":"http://localhost:1313/post/post10/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post10/","section":"post","summary":"The most important skills at work.","tags":["Academic"],"title":"Demanded knowledge in the field of Data Science","type":"post"},{"authors":["Angelika"],"categories":["Demo"],"content":"Content First, the user needs to prepare a file with text equipped commands for LaTeX, which traditionally has a .tex extension. Further the procedures take place in two stages:\nFirst of all, you should process the file using a translator program. IN the result will be a file with the extension .dvi (device-independent, that is, independent from the device).\nFurther, the generated file, also called a dvi-file, can be used using programs which are called dvi drivers, print on a laser or dot matrix printer, look at the screen, and so on. If the results are unsatisfactory, the user can make changes to the source file, after which the cycle repeats. The source file for the LaTeX system is the actual text of the document along with special characters and commands with which instructions should be transmitted to the system regarding text placement. This file can be generated using any text editor, but in this case it is necessary that the so-called pure text file (ASCII file). This means that the text should not contain font highlighting, pagination, and the like. The source text of the document cannot have hyphens (LaTeX will generate them itself). Words must be separated by spaces, but LaTeX does not distinguish how many The user left spaces between words. The end of the line is also treated as space. Individual paragraphs must be separated from each other by blank lines. Most of the characters in the source text directly represent what follows print (if there is a comma in the source text, then there will be a comma in the print). A The following characters have a special status:\n{ } $ \u0026amp; # % _ ~ ~ \\ \u0026amp; # % _ ~ ~ \\\nIf one of these characters is used simply in the text, then most likely it will be issued error message. A printed display of the first seven characters can be obtained if In the source text, place the “\\” sign before the corresponding character without a space. When the % symbol is used in text other than as part of the % combination, it is considered “comment character”, that is, all characters that are located on the line after it, the program ignores. Using the % symbol, marks can be added to the source text with the status “for yourself”. Curly braces delimit groups in the source file. Dollar symbol limits mathematical formulas. When entering mathematical formulas, the _ and ^ signs are used (“the sign underscore\u0026#34; and “lid”). The ~ sign is intended to indicate a “non-breaking space” between words. All LaTeX commands begin with a . The # and \u0026amp; signs are used in more complex LaTeX constructions.\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1607817600,"objectID":"122591be03ff19b49a97c0378f58bb18","permalink":"http://localhost:1313/post/post4/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post4/","section":"post","summary":"Latex uses a special markup language, transforming the source text along with its markup into a high-quality document.","tags":["Academic"],"title":"Latex markup language","type":"post"},{"authors":["Angelika","Анжелика"],"categories":["Demo"],"content":"How was my week in April? I have done a lot of homework and can finally be free. Played visual novels Started learning Japanese I wish you a good time too!\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1713225600,"objectID":"918c2ae645793b070e27ace951359a94","permalink":"http://localhost:1313/post/post5/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post5/","section":"post","summary":"Another ordinary day","tags":["Week","Анжелика"],"title":"Post about the past week 3","type":"post"},{"authors":["Angelika"],"categories":["Science"],"content":"What programming languages ​​are widely represented in science? Python is one of the most powerful and flexible languages ​​that is also widely used in data science. The main reason is its simple and elegant syntax, as well as a large collection of third-party libraries. A tool that can be found all over the data science field is Jupyter. Jupyter notebooks let you quickly see the results of your code, plot your data, and create code documentation using markup blocks. It is not a Python-only tool, but the most common combination is Python and Jupyter.\nR is an open-source programming language first introduced in 1993 and used for statistical computing, data analysis, and machine learning. According to Stack Overflow analysis, R’s popularity has been growing over the past few years.\nAlthough R is widely used by researchers, it is now also used by large technology companies such as Google, Facebook and Twitter for data analysis and statistics.\nJulia takes the best of languages ​​like Python, Ruby, Lisp, and R, combines it with the speed of C, and includes familiar math notation like Matlab. We can call Julia an ambitious attempt to create a language that is good enough for general programming and at the same time amazing for specific computer science disciplines such as machine learning, data mining, distributed and parallel computing. One of the main advantages of Julia is its speed, comparable to languages ​​such as C, Rust, Lua and Go. This is because it is compiled using the Just-In-Time (JIT) principle.\nMATLAB is a proprietary programming language used by millions of engineers and scientists for mathematical and statistical computing.\nScala is a high-level programming language first introduced in 2004 that runs in the JVM (Java Virtual Machine) or with JavaScript in your browser. Many data scientists have included Scala in their toolkit because it is invaluable when it comes to analyzing large amounts of data. According to the Stack Overflow 2021 study, Scala is the 7th highest paid language in the world. But you need to be careful with these statistics, since working in Scala is not that common in the industry. Since Scala runs on the JVM, you’ll have access to a ton of existing libraries and some Scala-only packages used in the fields of big data, mathematics, databases, and computer science in general. If you’re already fluent in Java, Scala may be the right language for you to transition into data science.\nJava has been one of the most common and beloved programming languages ​​for several decades. It is a universal language that can be used in almost every situation imaginable. Data science is no exception. Although Java is primarily used in mobile and web applications, due to its strong user base, it is used along with other popular frameworks such as Hadoop or Spark for analyzing large volumes of data. Java can be used in most areas of data science such as database management, machine learning. If you know Java, it is much easier to master a couple of libraries than to learn to use a completely different language like R or Julia.\nThe C++ language completes this list. Although it is used primarily to create applications and operating systems, without it we would not have seen the current rise of data science. Data scientists prefer languages ​​like Python or R that are easy to use and debug because they don’t want to waste time fixing weird bugs in C/C++. However, C++ plays an important role in data science because many libraries used in other languages ​​are written in it. Building a machine learning model requires computational effort, so using an efficient language like C++ makes sense. If you want to get involved in the data science industry by developing libraries for other languages, C++ may be the right choice.\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1713312000,"objectID":"eff061ee8a24f8f74005b0514c080a17","permalink":"http://localhost:1313/post/post8/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post8/","section":"post","summary":"What languages ​​are needed to work in data science, machine learning, etc.","tags":["Academic"],"title":"Scientific programming languages","type":"post"},{"authors":["Angelika"],"categories":["Demo"],"content":"What’s new? 23 April was my birthday and now I’m 20. I went to a Japanese restaurant and had a nice time stydying in a small cafe. I’ve also bought a textbook for German as gift to myself. And I got congratulations from a lot of my friends!\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1714003200,"objectID":"6b14675d44e331e53c790a5322187755","permalink":"http://localhost:1313/post/post9/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post9/","section":"post","summary":"What’s new? 23 April was my birthday and now I’m 20. I went to a Japanese restaurant and had a nice time stydying in a small cafe. I’ve also bought a textbook for German as gift to myself.","tags":["Casual"],"title":"The post is about the last April week","type":"post"},{"authors":["Angelika","吳恩達"],"categories":["Demo","教程"],"content":"import libr print(\u0026#39;hello\u0026#39;) Overview The Wowchemy website builder for Hugo, along with its starter templates, is designed for professional creators, educators, and teams/organizations - although it can be used to create any kind of site The template can be modified and customised to suit your needs. It’s a good platform for anyone looking to take control of their data and online identity whilst having the convenience to start off with a no-code solution (write in Markdown and customize with YAML parameters) and having flexibility to later add even deeper personalization with HTML and CSS You can work with all your favourite tools and apps with hundreds of plugins and integrations to speed up your workflows, interact with your readers, and much more Get Started 👉 Create a new site 📚 Personalize your site 💬 Chat with the Wowchemy community or Hugo community 🐦 Twitter: @wowchemy @GeorgeCushen #MadeWithWowchemy 💡 Request a feature or report a bug for Wowchemy ⬆️ Updating Wowchemy? View the Update Tutorial and Release Notes Crowd-funded open-source software To help us develop this template and software sustainably under the MIT license, we ask all individuals and businesses that use it to help support its ongoing maintenance and development via sponsorship.\n❤️ Click here to become a sponsor and help support Wowchemy’s future ❤️ As a token of appreciation for sponsoring, you can unlock these awesome rewards and extra features 🦄✨\nEcosystem Hugo Academic CLI: Automatically import publications from BibTeX Inspiration Check out the latest demo of what you’ll get in less than 10 minutes, or view the showcase of personal, project, and business sites.\nFeatures Page builder - Create anything with widgets and elements Edit any type of content - Blog posts, publications, talks, slides, projects, and more! Create content in Markdown, Jupyter, or RStudio Plugin System - Fully customizable color and font themes Display Code and Math - Code highlighting and LaTeX math supported Integrations - Google Analytics, Disqus commenting, Maps, Contact Forms, and more! Beautiful Site - Simple and refreshing one page design Industry-Leading SEO - Help get your website found on search engines and social media Media Galleries - Display your images and videos with captions in a customizable gallery Mobile Friendly - Look amazing on every screen with a mobile friendly version of your site Multi-language - 34+ language packs including English, 中文, and Português Multi-user - Each author gets their own profile page Privacy Pack - Assists with GDPR Stand Out - Bring your site to life with animation, parallax backgrounds, and scroll effects One-Click Deployment - No servers. No databases. Only files. Themes Wowchemy and its templates come with automatic day (light) and night (dark) mode built-in. Alternatively, visitors can choose their preferred mode - click the moon icon in the top right of the Demo to see it in action! Day/night mode can also be disabled by the site admin in params.toml.\nChoose a stunning theme and font for your site. Themes are fully customizable.\nLicense Copyright 2016-present George Cushen.\nReleased under the MIT license.\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1607817600,"objectID":"279b9966ca9cf3121ce924dca452bb1c","permalink":"http://localhost:1313/post/getting-started/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/getting-started/","section":"post","summary":"Welcome 👋 We know that first impressions are important, so we've populated your new site with some initial content to help you get familiar with everything in no time.","tags":["Academic","开源"],"title":"Welcome to Hugo Blox Builder, the website builder for Hugo","type":"post"},{"authors":["Angelika"],"categories":["Demo"],"content":"Description of the school week I took a course in machine learning and completed quite a lot. I plan to make my own project based on it. I had a lot of laboratory work, but I managed to do everything. Didn’t have time to do math Hobbies I found people with whom I will practice English and German. We communicate quite friendly. I also found people with whom I regularly study machine learning as a team.\n","date":1607817600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1710201600,"objectID":"fe859c6266641600992fd6a0d6f11947","permalink":"http://localhost:1313/post/post1/","publishdate":"2020-12-13T00:00:00Z","relpermalink":"/post/post1/","section":"post","summary":"Hello👋 I'll tell you about how frantic the pace of my activity was last week","tags":["Academic"],"title":"What happened this week?","type":"post"},{"authors":["Angelika"],"categories":["Demo"],"content":"What happened? I was preparing for the test and was very worried, but everything went well in the end. I also began to study German more often. I started preparing for the calculus exam. In general, studies are in full swing. It’s also my birthday soon!\n","date":1587081600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1713312000,"objectID":"0f37a544ce2716192b081086f7f67b23","permalink":"http://localhost:1313/post/post7/","publishdate":"2020-04-17T00:00:00Z","relpermalink":"/post/post7/","section":"post","summary":"It will be interesting","tags":["Сasual"],"title":"How the week went at the end of April.","type":"post"},{"authors":null,"categories":null,"content":"Hugo Blox Builder is designed to give technical content creators a seamless experience. You can focus on the content and Wowchemy handles the rest.\nHighlight your code snippets, take notes on math classes, and draw diagrams from textual representation.\nOn this page, you’ll find some examples of the types of technical content that can be rendered with Wowchemy.\nExamples Code Wowchemy supports a Markdown extension for highlighting code syntax. You can customize the styles under the syntax_highlighter option in your config/_default/params.yaml file.\n```python import pandas as pd data = pd.read_csv(\u0026#34;data.csv\u0026#34;) data.head() ``` renders as\nimport pandas as pd data = pd.read_csv(\u0026#34;data.csv\u0026#34;) data.head() Mindmaps Wowchemy supports a Markdown extension for mindmaps.\nSimply insert a Markdown markmap code block and optionally set the height of the mindmap as shown in the example below.\nA simple mindmap defined as a Markdown list:\n```markmap {height=\u0026#34;200px\u0026#34;} - Hugo Modules - wowchemy - blox-plugins-netlify - blox-plugins-netlify-cms - blox-plugins-reveal ``` renders as\n- Hugo Modules - wowchemy - blox-plugins-netlify - blox-plugins-netlify-cms - blox-plugins-reveal A more advanced mindmap with formatting, code blocks, and math:\n```markmap - Mindmaps - Links - [Wowchemy Docs](https://docs.hugoblox.com/) - [Discord Community](https://discord.gg/z8wNYzb) - [GitHub](https://github.com/HugoBlox/hugo-blox-builder) - Features - Markdown formatting - **inline** ~~text~~ *styles* - multiline text - `inline code` - ```js console.log(\u0026#39;hello\u0026#39;); console.log(\u0026#39;code block\u0026#39;); ``` - Math: $x = {-b \\pm \\sqrt{b^2-4ac} \\over 2a}$ ``` renders as\n- Mindmaps - Links - [Wowchemy Docs](https://docs.hugoblox.com/) - [Discord Community](https://discord.gg/z8wNYzb) - [GitHub](https://github.com/HugoBlox/hugo-blox-builder) - Features - Markdown formatting - **inline** ~~text~~ *styles* - multiline text - `inline code` - ```js console.log(\u0026#39;hello\u0026#39;); console.log(\u0026#39;code block\u0026#39;); ``` - Math: $x = {-b \\pm \\sqrt{b^2-4ac} \\over 2a}$ Charts Wowchemy supports the popular Plotly format for interactive charts.\nSave your Plotly JSON in your page folder, for example line-chart.json, and then add the {{\u0026lt; chart data=\u0026#34;line-chart\u0026#34; \u0026gt;}} shortcode where you would like the chart to appear.\nDemo:\nYou might also find the Plotly JSON Editor useful.\nMath Wowchemy supports a Markdown extension for $\\LaTeX$ math. You can enable this feature by toggling the math option in your config/_default/params.yaml file.\nTo render inline or block math, wrap your LaTeX math with {{\u0026lt; math \u0026gt;}}$...${{\u0026lt; /math \u0026gt;}} or {{\u0026lt; math \u0026gt;}}$$...$${{\u0026lt; /math \u0026gt;}}, respectively. (We wrap the LaTeX math in the Wowchemy math shortcode to prevent Hugo rendering our math as Markdown. The math shortcode is new in v5.5-dev.)\nExample math block:\n{{\u0026lt; math \u0026gt;}} $$ \\gamma_{n} = \\frac{ \\left | \\left (\\mathbf x_{n} - \\mathbf x_{n-1} \\right )^T \\left [\\nabla F (\\mathbf x_{n}) - \\nabla F (\\mathbf x_{n-1}) \\right ] \\right |}{\\left \\|\\nabla F(\\mathbf{x}_{n}) - \\nabla F(\\mathbf{x}_{n-1}) \\right \\|^2} $$ {{\u0026lt; /math \u0026gt;}} renders as\n$$\\gamma_{n} = \\frac{ \\left | \\left (\\mathbf x_{n} - \\mathbf x_{n-1} \\right )^T \\left [\\nabla F (\\mathbf x_{n}) - \\nabla F (\\mathbf x_{n-1}) \\right ] \\right |}{\\left \\|\\nabla F(\\mathbf{x}_{n}) - \\nabla F(\\mathbf{x}_{n-1}) \\right \\|^2}$$ Example inline math {{\u0026lt; math \u0026gt;}}$\\nabla F(\\mathbf{x}_{n})${{\u0026lt; /math \u0026gt;}} renders as $\\nabla F(\\mathbf{x}_{n})$.\nExample multi-line math using the math linebreak (\\\\):\n{{\u0026lt; math \u0026gt;}} $$f(k;p_{0}^{*}) = \\begin{cases}p_{0}^{*} \u0026amp; \\text{if }k=1, \\\\ 1-p_{0}^{*} \u0026amp; \\text{if }k=0.\\end{cases}$$ {{\u0026lt; /math \u0026gt;}} renders as\n$$ f(k;p_{0}^{*}) = \\begin{cases}p_{0}^{*} \u0026amp; \\text{if }k=1, \\\\ 1-p_{0}^{*} \u0026amp; \\text{if }k=0.\\end{cases} $$ Diagrams Wowchemy supports a Markdown extension for diagrams. You can enable this feature by toggling the diagram option in your config/_default/params.toml file or by adding diagram: true to your page front matter.\nAn example flowchart:\n```mermaid graph TD A[Hard] --\u0026gt;|Text| B(Round) B --\u0026gt; C{Decision} C --\u0026gt;|One| D[Result 1] C --\u0026gt;|Two| E[Result 2] ``` renders as\ngraph TD A[Hard] --\u0026gt;|Text| B(Round) B --\u0026gt; C{Decision} C --\u0026gt;|One| D[Result 1] C --\u0026gt;|Two| E[Result 2] An example sequence diagram:\n```mermaid sequenceDiagram Alice-\u0026gt;\u0026gt;John: Hello John, how are you? loop Healthcheck John-\u0026gt;\u0026gt;John: Fight against hypochondria end Note right of John: Rational thoughts! John--\u0026gt;\u0026gt;Alice: Great! John-\u0026gt;\u0026gt;Bob: How about you? Bob--\u0026gt;\u0026gt;John: Jolly good! ``` renders as\nsequenceDiagram Alice-\u0026gt;\u0026gt;John: Hello John, how are you? loop Healthcheck John-\u0026gt;\u0026gt;John: Fight against hypochondria end Note right of John: Rational thoughts! John--\u0026gt;\u0026gt;Alice: Great! John-\u0026gt;\u0026gt;Bob: How about you? Bob--\u0026gt;\u0026gt;John: Jolly good! An example Gantt diagram:\n```mermaid gantt section Section Completed :done, des1, 2014-01-06,2014-01-08 Active :active, des2, 2014-01-07, 3d Parallel 1 : des3, after des1, 1d Parallel 2 : des4, after des1, 1d Parallel 3 : des5, after des3, 1d Parallel 4 : des6, after des4, 1d ``` renders as\ngantt section …","date":1562889600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1562889600,"objectID":"20e13568dbeca90f08fcad3eeed1e329","permalink":"http://localhost:1313/writing-technical-content/","publishdate":"2019-07-12T00:00:00Z","relpermalink":"/writing-technical-content/","section":"","summary":"Hugo Blox Builder is designed to give technical content creators a seamless experience. You can focus on the content and Wowchemy handles the rest.\nHighlight your code snippets, take notes on math classes, and draw diagrams from textual representation.","tags":null,"title":"Writing technical content in Markdown","type":"page"},{"authors":["Angelika"],"categories":null,"content":" Create your slides in Markdown - click the Slides button to check out the example. Add the publication’s full text or supplementary notes here. You can use rich formatting such as including code, math, and images.\n","date":1554595200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1554595200,"objectID":"557dc08fd4b672a0c08e0a8cf0c9ff7d","permalink":"http://localhost:1313/publication/preprint/","publishdate":"2017-01-01T00:00:00Z","relpermalink":"/publication/preprint/","section":"publication","summary":"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Duis posuere tellus ac convallis placerat. Proin tincidunt magna sed ex sollicitudin condimentum.","tags":["Source Themes"],"title":"An example preprint / working paper","type":"publication"},{"authors":[],"categories":[],"content":"Create slides in Markdown with Hugo Blox Builder Hugo Blox Builder | Documentation\nFeatures Efficiently write slides in Markdown 3-in-1: Create, Present, and Publish your slides Supports speaker notes Mobile friendly slides Controls Next: Right Arrow or Space Previous: Left Arrow Start: Home Finish: End Overview: Esc Speaker notes: S Fullscreen: F Zoom: Alt + Click PDF Export Code Highlighting Inline code: variable\nCode block:\nporridge = \u0026#34;blueberry\u0026#34; if porridge == \u0026#34;blueberry\u0026#34;: print(\u0026#34;Eating...\u0026#34;) Math In-line math: $x + y = z$\nBlock math:\n$$ f\\left( x \\right) = ;\\frac{{2\\left( {x + 4} \\right)\\left( {x - 4} \\right)}}{{\\left( {x + 4} \\right)\\left( {x + 1} \\right)}} $$\nFragments Make content appear incrementally\n{{% fragment %}} One {{% /fragment %}} {{% fragment %}} **Two** {{% /fragment %}} {{% fragment %}} Three {{% /fragment %}} Press Space to play!\nOne Two Three A fragment can accept two optional parameters:\nclass: use a custom style (requires definition in custom CSS) weight: sets the order in which a fragment appears Speaker Notes Add speaker notes to your presentation\n{{% speaker_note %}} - Only the speaker can read these notes - Press `S` key to view {{% /speaker_note %}} Press the S key to view the speaker notes!\nOnly the speaker can read these notes Press S key to view Themes black: Black background, white text, blue links (default) white: White background, black text, blue links league: Gray background, white text, blue links beige: Beige background, dark text, brown links sky: Blue background, thin dark text, blue links night: Black background, thick white text, orange links serif: Cappuccino background, gray text, brown links simple: White background, black text, blue links solarized: Cream-colored background, dark green text, blue links Custom Slide Customize the slide style and background\n{{\u0026lt; slide background-image=\u0026#34;/media/boards.jpg\u0026#34; \u0026gt;}} {{\u0026lt; slide background-color=\u0026#34;#0000FF\u0026#34; \u0026gt;}} {{\u0026lt; slide class=\u0026#34;my-style\u0026#34; \u0026gt;}} Custom CSS Example Let’s make headers navy colored.\nCreate assets/css/reveal_custom.css with:\n.reveal section h1, .reveal section h2, .reveal section h3 { color: navy; } Questions? Ask\nDocumentation\n","date":1549324800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1549324800,"objectID":"0e6de1a61aa83269ff13324f3167c1a9","permalink":"http://localhost:1313/slides/example/","publishdate":"2019-02-05T00:00:00Z","relpermalink":"/slides/example/","section":"slides","summary":"An introduction to using Hugo Blox Builder's Slides feature.","tags":[],"title":"Slides","type":"slides"},{"authors":null,"categories":null,"content":"Будет создана социальная сеть для знакомств, обсуждений на различные темы и выкладывания полезных учебных материалов.\n","date":1461715200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1461715200,"objectID":"d1311ddf745551c9e117aa4bb7e28516","permalink":"http://localhost:1313/project/external-project/","publishdate":"2016-04-27T00:00:00Z","relpermalink":"/project/external-project/","section":"project","summary":"My first project with C++.","tags":["C++"],"title":"C++ program for chatting","type":"project"},{"authors":null,"categories":null,"content":"Бот предоставляет помощь в изучении иностранных языков. Поддерживаются английский, японский, китайский, французский, немецкий и испанский язык. Бот высылает все полезные сайты, учебники, аудио\n","date":1461715200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1461715200,"objectID":"e8f8d235e8e7f2efd912bfe865363fc3","permalink":"http://localhost:1313/project/example/","publishdate":"2016-04-27T00:00:00Z","relpermalink":"/project/example/","section":"project","summary":"my first project","tags":["Python"],"title":"The language helper","type":"project"},{"authors":["Angelika","Robert Ford"],"categories":null,"content":" Click the Cite button above to demo the feature to enable visitors to import publication metadata into their reference management software. Create your slides in Markdown - click the Slides button to check out the example. Add the publication’s full text or supplementary notes here. You can use rich formatting such as including code, math, and images.\n","date":1441065600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1441065600,"objectID":"966884cc0d8ac9e31fab966c4534e973","permalink":"http://localhost:1313/publication/journal-article/","publishdate":"2017-01-01T00:00:00Z","relpermalink":"/publication/journal-article/","section":"publication","summary":"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Duis posuere tellus ac convallis placerat. Proin tincidunt magna sed ex sollicitudin condimentum.","tags":["Source Themes"],"title":"An example journal article","type":"publication"},{"authors":["Angelika","Robert Ford"],"categories":null,"content":" Click the Cite button above to demo the feature to enable visitors to import publication metadata into their reference management software. Create your slides in Markdown - click the Slides button to check out the example. Add the publication’s full text or supplementary notes here. You can use rich formatting such as including code, math, and images.\n","date":1372636800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1372636800,"objectID":"69425fb10d4db090cfbd46854715582c","permalink":"http://localhost:1313/publication/conference-paper/","publishdate":"2017-01-01T00:00:00Z","relpermalink":"/publication/conference-paper/","section":"publication","summary":"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Duis posuere tellus ac convallis placerat. Proin tincidunt magna sed ex sollicitudin condimentum.","tags":[],"title":"An example conference paper","type":"publication"}]